<template>
<div>
  <div v-if="modal" class="modal-mask">
      <div class="modal-wrapper">
        <div class="modal-container">
          <div class="modal-header">
            柯咔服装网用户协议
          </div>
          <div class="modal-body">
            <p>欢迎您与广州柯咔网络科技有限公司（以下简称“柯咔”）就柯咔服装网（域名：柯咔buy.com）服务等相关事宜共同签署《柯咔服装网用户协议》（以下简称“本协议”）。</p>

            <p>您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与柯咔达成一致，成为柯咔服装网用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</p>

            <div class="part">
              <h3>一、接受条款</h3>
              <h4>1.本协议内容包括协议正文及所有柯咔服装网已经发布或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。</h4>
              <h4>2.柯咔服装网的各项电子服务的所有权和运作权归柯咔所有。用户同意所有注册协议条款并完成注册及认证程序，才能成为柯咔服装网的正式用户。</h4>
              <h4>3.柯咔保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</h4>
              <h4>4.用户点击同意本协议，即视为用户确认自己具有享受平台服务的权利能力和行为能力，能够独立承担法律责任。</h4>
              <h4>5.柯咔有权根据需要制订、修改本协议及/或各类规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在柯咔服装网公布后，立即自动生效。如您不同意相关变更，应当立即停止使用柯咔服装网平台服务。您继续使用柯咔服装网服务的，即表示您接受经修订的协议和规则。</h4>
              <h4>6.本协议不涉及用户与柯咔其它用户之间因网上交易而产生的法律关系及法律纠纷。</h4>
            </div>

            <div class="part">
              <h3>二、账号注册及使用</h3>
              <h4>1.账户注册</h4>
              <p>1.1 在您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他柯咔允许的方式实际使用柯咔服务时，您即受本协议的约束。</p>
              <p>1.2 您了解并同意，如您系在本网站完成的注册程序，只要您注册成功，您即可以获得您的柯咔登录名。您在此明确授权，您的账户信息在您注册成功时，已授权柯咔服装网披露并使用，以使您更便捷地使用柯咔服务。</p>
              <h4>2.账户使用</h4> 
              <p>2.1 您可以使用您提供或确认的邮箱、手机号码或者柯咔允许的其它方式作为登录手段进入柯咔网站。</p> 
              <p>2.2 由于您的柯咔账户关联您的个人信息及柯咔服装网商业信息，您的柯咔账户仅限您本人使用。未经柯咔平台同意，您直接或间接授权第三方使用您的柯咔账户或获取您账户项下信息的行为无效。如柯咔服装网判断您柯咔账户的使用可能危及您的账户安全及/或柯咔服装网信息安全的，柯咔服装网可拒绝提供相应服务或终止本协议。</p> 
              <h4>3.信息真实</h4> 
              <p>在完成注册及认证流程时，您应当按照法律法规要求，正确提供注册所需的资料和资质文件，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，柯咔有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部平台服务，柯咔对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。</p>
              <h4>4.账户安全</h4>  
              <p>您须自行负责对您的柯咔登录名、昵称和密码保密，且须对该登录名、昵称和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：</p> 
              <p>4.1 如发现任何人未经授权使用您的柯咔登录名、昵称和密码，或发生违反保密规定的任何其他情况，您会立即通知柯咔，并授权柯咔将该信息同步给柯咔网站；</p> 
              <p>4.2 确保您在每个上网时段结束时，以正确步骤离开网站。柯咔不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。您理解柯咔对您的请求采取行动需要合理时间，柯咔对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。除非有法律规定或司法裁定，且征得柯咔的同意，否则，您的柯咔登录名、昵称和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。</p>
            </div>

            <div class="part">

              <h3>三、服务终止</h3>

              <h4>1.您同意，在柯咔未向您收费的情况下，柯咔可自行全权决定以任何理由（包括但不限于柯咔认为您已违反本协议的字面意义和精神，或您以不符合本协议的字面意义和精神的方式行事）终止您的「服务」密码、账户（或其任何部份）或您对「服务」的使用。您同意，在 柯咔向您收费的情况下，柯咔应基于合理的怀疑且经电子邮件通知的情况下实施上述终止服务的行为。您进一步承认和同意，柯咔根据本协议规定终止您服务的情况下可立即使您的账户无效，或注销您的账户以及在您的账户内的所有相关资料和档案，和（或）禁止您进一步接入该等档案或「服务」。账户终止后，柯咔没有义务为您保留原账户中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。此外，您同意，柯咔不会就终止向您提供「服务」而对您或任何第三者承担任何责任。</h4>         

              <h4>2.您有权向柯咔要求注销您的账户，经柯咔审核同意的，柯咔将注销您的账户，届时，您与柯咔基于本协议的合同关系即终止。您的账户被注销后，柯咔没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</h4> 

              <h4>3.您理解并同意，您与柯咔的合同关系终止后：</h4> 

              <p>3.1 柯咔有权继续保存您的资料。</p>

              <p>3.2 您在使用服务期间存在违法行为和（或）违反本协议或规则的行为的，柯咔仍可依据本协议向您主张权利。</p>

              <p>3.3 您在使用服务期间因使用服务与其他用户之间发生的关系，不因本协议的终止而终止，其他用户仍有权向您主张权利，您应继续按您的承诺履行义务。</p>

            </div>

            <div class="part">

              <h3>四、关于费用</h3>

              <h4>1.目前柯咔服装网向您提供的服务均为免费。如未来柯咔向您收取合理费用，柯咔会采取合理途径并以足够合理的期限提前通过法定程序并以本协议第一条第5款约定的方式通知您，确保您有充分选择的权利。</h4>
      
              <h4>2.您因进行交易、向柯咔获取有偿服务或接触柯咔服务器而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。柯咔保留在无须发出书面通知，仅在网站公示的情况下，暂时或永久地更改或停止部分或全部“服务”的权利。</h4> 
          
            </div>

            <div class="part">

              <h3>五、平台服务及使用规范</h3>

              <h4>1.平台服务</h4>

              <p>1.1 通过柯咔服装网提供的平台服务，您可在柯咔服装网网站上发布交易信息、查询商品和服务信息、达成交易意向并进行交易、对其他用户进行评价、参加柯咔服装网组织的活动以及使用其它信息服务及技术服务。</p>

              <p>1.2 柯咔服装网仅作为用户物色交易对象，就货物和服务的交易进行协商，以及获取各类与贸易相关的服务的地点。同时，柯咔服装网不涉及用户间因交易而产生的法律关系及法律纠纷，不会且不能牵涉进交易各方的交易当中。</p>

              <p>1.3 敬请注意，柯咔不能控制或保证商贸信息的真实性、合法性、准确性，亦不能控制或保证交易所涉及的物品的质量、安全或合法性，以及相关交易各方履行在贸易协议项下的各项义务的能力。柯咔不能也不会控制交易各方能否履行协议义务。此外，您应注意到，与以欺诈手段行事的人进行交易的风险是客观存在的。柯咔希望您在使用柯咔服装网时，小心谨慎并运用常识。</p>

              <h4>2.使用规范</h4> 

              <p>2.1 在柯咔服装网平台上使用柯咔服装网服务过程中，您承诺遵守以下约定：</p>
 
              <p>（1）在使用柯咔服装网平台服务过程中实施的所有行为均遵守国家法律、法规等规范性文件及柯咔服装网平台各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保柯咔服装网免于因此产生任何损失。</p> 

              <p>（2）在与其他用户交易过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为</p>

              <p>（3）不发布国家禁止销售的或限制销售的商品或服务信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的商品或服务信息，不发布违背社会公共利益或公共道德或柯咔服装网认为不适合在柯咔服装网平台上销售的商品或服务信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。</p>

              <p>（4）不以虚构或歪曲事实的方式不当评价其他用户，不采取不正当方式制造或提高自身的信用度，不采取不正当方式制造或提高（降低）其他用户的信用度。</p>

              <p>（5） 不对柯咔服装网平台上的任何数据作商业性利用，包括但不限于在未经柯咔服装网事先书面同意的情况下，以复制、传播等任何方式使用柯咔服装网平台站上展示的资料。</p> 

              <p>（6）不使用任何装置、软件或例行程序干预或试图干预柯咔服装网平台的正常运作或正在柯咔服装网平台上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸柯咔服装网平台网络设备的行动。</p>

              <p>2.2 您了解并同意：</p>

              <p>（1）柯咔服装网有权对您是否违反上述承诺做出单方认定，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。</p> 

              <p>（2）经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者柯咔服装网根据自身的判断，认为您的行为涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，则柯咔服装网有权在柯咔服装网平台上公示您的该等涉嫌违法或违约行为及柯咔服装网已对您采取的措施。</p>

              <p>（3）对于您在柯咔服装网平台上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，柯咔服装网有权不经通知您即予以删除，且按照规则的规定进行处罚。</p>

              <p>（4）对于您在柯咔服装网平台上实施的行为，包括您未在柯咔服装网平台上实施但已经对柯咔服装网平台及其用户产生影响的行为，柯咔服装网有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并据此作出相应处罚。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。</p>

              <p>（5）对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保柯咔服装网免于因此产生损失或增加费用。</p> 

              <p>（6）如您涉嫌违反有关法律或者本协议之规定，使柯咔服装网遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿柯咔服装网因此造成的损失及（或）发生的费用，包括合理的律师费用。</p>
             
            </div>

            <div class="part">

              <h3>六、特别授权</h3>

              <p>您完全理解并同意不可撤销地授予柯咔及其关联公司下列权利：</p>

              <h4>1.对于您提供的资料，您授予柯咔及其关联公司独家的、全球通用的、永久的、免费的许可使用权利(并有权在多个层面对该权利进行再授权)，使柯咔及其关联公司有权(全部或部份地)使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于柯咔服装网平台的各类信息）或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其他作品内。</h4> 

              <h4>2.当您违反本协议或与柯咔签订的其他协议的约定，柯咔有权以任何方式通知关联公司，且在其经营或实际控制的任何网站公示您的违约情况。</h4> 

              <h4>3.同样，当您向柯咔关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺，则柯咔有权立即按您的承诺约定的方式对您的账户采取限制措施，包括但不限于中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，柯咔无须就相关确认与您核对事实，或另行征得您的同意，且柯咔无须就此限制措施或公示行为向您承担任何的责任。</h4> 

            </div>

            <div class="part">

              <h3>七、赔偿责任</h3>

              <h4>1.如您的行为使柯咔及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿柯咔及/或其关联公司的上述全部损失。</h4>
             
              <h4>2.如您的行为使柯咔及/或其关联公司遭受第三人主张权利，柯咔及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。</h4> 

              <h4>3.如因您的行为使得第三人遭受损失或您怠于履行调处决定、柯咔及/或其关联公司出于社会公共利益保护或消费者权益保护目的，可自您的柯咔账户中划扣相应款项进行支付。如您的柯咔账户余额或保证金不足以支付相应款项的，您同意委托柯咔使用自有资金代您支付上述款项，您应当返还该部分费用并赔偿因此造成柯咔的全部损失。</h4> 

            </div>

            <div class="part">

              <h3>八、责任范围和限制</h3>

              <h4>1.对于因柯咔合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使柯咔延迟或未能履约的，柯咔不对您承担任何责任。</h4>
     
              <h4>2.本协议项下服务将按“现状”和按“可得到”的状态提供，柯咔在此明确声明对服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，柯咔服装网网也不对柯咔服装网平台服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。</h4> 

              <h4>3.除非法律法规明确要求，或出现以下情况，否则，柯咔服装网没有义务对所有用户的注册数据、商品（服务）信息、交易行为以及与交易有关的其它事项进行事先审查：</h4> 

              <p>3.1 柯咔服装网有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形。</p> 

              <p>3.2 柯咔服装网有合理的理由认为用户在柯咔服装网平台的行为涉嫌违法或不当。</p> 

              <p>3.3 柯咔服装网及其关联公司有权受理您与其他会员因交易产生的争议，并有权单方判断与该争议相关的事实及应适用的规则，进而作出处理决定。该处理决定对您有约束力。如您未在限期内执行处理决定的，则柯咔服装网及其关联公司有权利（但无义务）直接使用您酷有宝账户内的款项，或您向柯咔服装网及其关联公司交纳的保证金代为支付。您应及时补足保证金并弥补柯咔服装网及其关联公司的损失，否则柯咔服装网及其关联公司有权直接抵减您在其它合同项下的权益，并有权继续追偿。</p>

              <p>您理解并同意，柯咔服装网及其关联公司并非司法机构，仅能以普通人的身份对证据进行鉴别，柯咔服装网及其关联公司对争议的调处完全是基于您的委托，柯咔服装网及其关联公司无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。</p>

            </div>

            <div class="part">

              <h3>九、通知</h3>

              <h4>1.您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便柯咔或其他用户与您进行有效联系。因通过这些联系方式无法与您取得联系，导致您在使用柯咔服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按柯咔的要求进行操作。</h4>
     
              <h4>2.您在注册柯咔服装网用户时生成的用于登陆柯咔服装网接收站内信、系统消息的会员账号（包括子账号），也作为您的有效联系方式。</h4>

              <h4>3.柯咔通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在柯咔服装网公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</h4>            

            </div>

            <div class="part">

              <h3>十、所有权及知识产权条款</h3>

              <h4>1.  柯咔是柯咔服装网的制作者，拥有此平台内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大范围内，柯咔对本协议及本平台内容拥有解释权。</h4>
     
              <h4>2.除法律另有强制性规定外，未经柯咔明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，柯咔有权追究其法律责任。</h4>         

            </div>

            <div class="part">

              <h3>十一、法律适用和管辖</h3>

              <h4>1.本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。</h4>
     
              <h4>2.因本协议或柯咔服务所引起或与其有关的任何争议应向柯咔所在地人民法院提起诉讼。</h4>         

            </div>
          </div>

          <div class="modal-footer">
            <button v-on:click="modal = false">确 定</button>
          </div>
        </div>
      </div>
    </div>

  <div class="register-t">
    <div class="container">
      <div class="row">
        <div class="col-md-12">
          <div class="register-t-tit">
            <a href="./index.html">
              <img src="../../assets/images/logo.svg" width="150">
            </a>
            <span>欢迎注册</span>
          </div>          
        </div>
      </div>
    </div>   
  </div>
  
  <div class="register-m">
    <div class="container">
      <div class="row">
        <div class="col-md-12">
          <div class="register">
            <div class="register-head">
              <div class="register-head-tit">
                新用户注册
              </div>
              <div class="register-head-menu">
                <span>已有账号?</span>
                <span><a href="./login.html">立即登录</a></span>
              </div>
            </div>
            <form v-on:submit="_submit">
              <div class="form-phone">
                <label>手<span class="em"></span><span class="em"></span>机</label>
                <div class="input-box">
                  <span class="icon-zhanghao"></span>
                  <input type="text" name="mobile" placeholder="请输入手机号码" ref="phone" v-on:blur="_checkPhone($event)" v-on:focus="_writePhone">
                </div>                        
              </div>
              <div class="form-psd">
                <label>密<span class="em"></span><span class="em"></span>码</label>
                <div class="input-box">
                  <span class="icon-mima"></span>
                  <input type="password" name="password" placeholder="请输入密码" ref="password" v-on:blur="_vitifyPwd($event)" v-on:focus="error = ''">
                </div>
              </div>
              <div class="form-psd-cfig">
                <label>确认密码</label>
                <div class="input-box">
                  <span class="icon-mima"></span>
                  <input type="password" name="password_confirmation" placeholder="请确认密码" ref="password_confirmation" v-on:blur="_vitifyConfPwd($event)" v-on:focus="error = ''">
                </div>
              </div>
              <div class="form-verify">
                <label>短信验证</label>
                <div class="input-box">
                  <input type="text" name="code" placeholder="请输入验证码">
                  <button type="button" v-bind:class="sendMsg ? 'after' : 'before'" v-bind:disabled="sendMsg" v-on:click="getCode">{{btnContent}}</button>
                </div>            
              </div>
              <div class="form-xieyi">
                <input type="checkbox" v-model="agree">
                <label>我已阅读并同意<a v-on:click="modal = true">《柯咔网络用户服务协议》</a></label>
              </div>
              <div class="form-err" v-bind:style="{display: error ? 'block' : 'none'}">
                {{error}}
              </div>
              <div class="form-submit">
                <button v-bind:disabled="!agree" v-bind:class="!agree ? 'disabled' : ''">注<span class="em"></span><span class="em"></span>册</button>
              </div>
            </form>
          </div>
        </div>
      </div>
    </div>
  </div>
  

  <div class="register-b">
    <div class="container">
      <div class="row">
        <div class="col-md-12">
          <div class="register-b-tit">
            Copyright©2017 广州柯咔网络科技有限公司  www.cookabuy.com  粤ICP备15091531号  客服热线:400-8868-900
          </div>          
        </div>
      </div>
    </div>   
  </div>  
</div>
</template>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<script>
  import Vue from 'vue'
  const VueResource = require('vue-resource')
  Vue.use(VueResource)
  const fto = require('form_to_object')
  Vue.use(fto)
  export default{
    data () {
      return {
        modal: false,
        error: '',
        btnContent: '获取短信验证码',
        sendMsg: false,
        sendTime: 60,
        agree: true
      }
    },
    methods: {
      _checkPhone (e) {
        if((!e.target.value) || (e.target.value && !(/^1[\d]{10}$/.test(this.$refs.phone.value)))){
          this.error = '请输入正确的手机号码'
        }
        else{
          this.$http.get('/jwt/check_exist?mobile=' + e.target.value)
            .then(
              function(ret){
                if(!ret.data.msg){
                  this.error = '';
                  this.sendMsg = false
                }
                else{
                  this.error = '该账号已注册';
                  this.sendMsg = true
                }
              },
              function(err){
                console.log(err)
            })
        }
        
      },
      _writePhone () {
        this.error = ''
      },
      _vitifyPwd (e) {
        var p = e.target.value
        var reg = /^[A-Za-z0-9/*-_.!@#$%^&*]{8,20}$/;
        if(!reg.test(p)){
          this.error = '密码为8-20位的数字、英文字母或特殊符号'
          return
        }
      },
      _vitifyConfPwd (e) {
        var pc = e.target.value
        var reg = /^[A-Za-z0-9/*-_.!@#$%^&*]{8,20}$/;
        if(!reg.test(pc)){
          this.error = '确认密码为8-20位的数字、英文字母或特殊符号'
          return
        }
        var p = this.$refs.password.value
        if(p != pc){
          this.error = '两次密码输入不一致'
          return
        }
      },
      getCode () {
        var me = this;
        if(!(/^1[\d]{10}$/.test(me.$refs.phone.value))){
          this.error = '请输入正确的手机号码'
        }
        else{
          this.$http.get('/jwt/send_code?mobile='+this.$refs.phone.value+'&type=sign_up')
          .then(function (ret) {
            if(ret.data.msg == 'OK'){
              me.sendMsg = true;
              me.btnContent = '获取验证码(' + me.sendTime + ')'
              var timer = setInterval(function(){          
                me.sendTime--
                me.btnContent = '获取验证码(' + me.sendTime + ')'
                if(me.sendTime == 0){
                  clearInterval(timer)
                  me.sendTime = 60
                  me.sendMsg = false
                  me.btnContent = '获取短信验证码'
                }
              },1000)
            }
          },
          function (err) {
            console.log(err)
          })
        }
        
      },
      _submit (e) {
        e.preventDefault();
        var data = fto(e.target)
        if (!data.mobile) {
          this.error = '手机号码不能为空'
          return false;
        }
        else{
          this.error = '';
        }
        if(!(/^1[\d]{10}$/.test(data.mobile))){
          this.error = '请输入正确的手机号码'
          return false;
        }
        else{
          this.error = ''
        }
        if(!data.password){          
          this.error = '密码不能为空'
          return false;
        }
        else if (data.password !== data.password_confirmation) {
          this.error = '两次密码输入不一致'
          return false;
        }
        else{
         this.error = ''
        }
        if (!data.code){          
          this.error = '验证码不能为空'
          return false;
        }
        else if (!(/^[\d]{6}$/.test(data.code))){
          this.error = '验证码格式不正确'
          return false;
        }
        else{
          this.error = ''
        }
        this.$http.post('/jwt/sign_up',{'user': data})
          .then(function (ret) {
            if(ret.data.msg == 'OK'){
              this.error = ''
              location.href = './login.html'
            }
            else if(ret.data.errors == 'Sms code is error.'){
              this.error = '验证码错误'
            } 
          },
          function (err) {
            console.log(err)
          })
      }
    },
    mounted () {
      
    }
  }
</script>
<style lang="less">
  @import '../../assets/css/icons.css';
  @import '../../assets/css/bootstrap.css';
  @import "../../assets/less/register.less";
</style>